app/Controllers/Carrito.php

    public function index()
    {
        $session = session();

        if (!$session->get('logueado')) {
            return redirect()->to('/');
        }

        $idCliente = $session->get('idCliente');

        $pedidoModel = new PedidoModel();
        $detallePedidoModel = new DetallePedidoModel();

        // Buscar el carrito actual del cliente
        $pedido = $pedidoModel
            ->where('idCliente', $idCliente)
            ->where('estado', 'carrito')
            ->first();

        $carrito = [];
        $total = 0;

        if ($pedido) {

            // Obtener los detalles junto con los datos del producto
            $carrito = $detallePedidoModel
                ->select('detalle_pedido.*, item_pedido.nombre, item_pedido.urlImagen')
                ->join(
                    'item_pedido',
                    'item_pedido.idItem = detalle_pedido.idItem'
                )
                ->where('idPedido', $pedido['idPedido'])
                ->findAll();
---
SELECT *
FROM `pedido`
WHERE `idCliente` = '14'
AND `estado` = 'carrito'
 LIMIT 1
SELECT `detalle_pedido`.*, `item_pedido`.`nombre`, `item_pedido`.`urlImagen`
FROM `detalle_pedido`
JOIN `item_pedido` ON `item_pedido`.`idItem` = `detalle_pedido`.`idItem`
WHERE `idPedido` = '5'

    public function cantidadCarrito()
    {
        $session = session();

        if (!$session->get('logueado')) {
            return $this->response->setJSON([
                'cantidad' => 0
            ]);
        }

        $idCliente = $session->get('idCliente');

        $pedidoModel = new PedidoModel();
        $detalleModel = new DetallePedidoModel();

        $pedido = $pedidoModel
            ->where('idCliente', $idCliente)
            ->where('estado', 'carrito')
            ->first();

        if (!$pedido) {
            return $this->response->setJSON([
                'cantidad' => 0
            ]);
        }

        $resultado = $detalleModel
            ->selectSum('cantidad')
            ->where('idPedido', $pedido['idPedido'])
            ->first();
---
SELECT *
FROM `pedido`
WHERE `idCliente` = '14'
AND `estado` = 'carrito'
 LIMIT 1
SELECT SUM(`cantidad`) AS `cantidad`
FROM `detalle_pedido`
WHERE `idPedido` = '7'
 LIMIT 1

    public function checkout()
    {
        $session = session();

        if (!$session->get('logueado')) {
            return redirect()->to('/');
        }

        $idCliente = $session->get('idCliente');

        $pedidoModel = new PedidoModel();
        $detallePedidoModel = new DetallePedidoModel();

        // Buscar el carrito actual del cliente
        $pedido = $pedidoModel
            ->where('idCliente', $idCliente)
            ->where('estado', 'carrito')
            ->first();

        // Si no existe un carrito, volver al carrito
        if (!$pedido) {
            return redirect()->to('/carrito');
        }

        // Obtener los productos del carrito
        $carrito = $detallePedidoModel
            ->select('detalle_pedido.*, item_pedido.nombre, item_pedido.urlImagen')
            ->join(
                'item_pedido',
                'item_pedido.idItem = detalle_pedido.idItem'
            )
            ->where('idPedido', $pedido['idPedido'])
            ->findAll();
---
SELECT *
FROM `pedido`
WHERE `idCliente` = '14'
AND `estado` = 'carrito'
 LIMIT 1
SELECT `detalle_pedido`.*, `item_pedido`.`nombre`, `item_pedido`.`urlImagen`
FROM `detalle_pedido`
JOIN `item_pedido` ON `item_pedido`.`idItem` = `detalle_pedido`.`idItem`
WHERE `idPedido` = '5'