app/Controllers/Home.php

    public function index(): string
    {

        $promocionModel = new PromocionModel();
        $itemPedidoModel = new ItemPedidoModel();
        $sucursalModel = new SucursalModel();

        $data['promociones'] = $promocionModel->obtenerPromociones();

        $data['promoDelDia'] = $promocionModel->obtenerPromoDelDia();

        $data['sucursales'] = $sucursalModel->where('activo', 1)->findAll();
---
SELECT *
FROM `sucursal`
WHERE `activo` = 1

    public function menu(): string{

        $productoModel = new ProductoModel();
        $categoriaModel = new CategoriaModel();

        $data['productos'] = $productoModel->obtenerProductosMenu();
        $data['categorias'] = $categoriaModel->findAll();
---
SELECT *
FROM `categoria`