app/Controllers/Producto.php

SELECT *
FROM `producto`
WHERE `producto`.`idItem` = 50
---
    public function actualizarImagen(int $idItem)
    {
        $itemPedidoModel = new ItemPedidoModel();
        $productoModel = new ProductoModel();

        // Verificar que exista como producto
        $producto = $productoModel->find($idItem);

SELECT *
FROM `item_pedido`
WHERE `item_pedido`.`idItem` = 50
---
        }

        // Obtener imagen anterior
        $productoActual = $itemPedidoModel->find($idItem);

UPDATE `item_pedido` SET `urlImagen` = '1790868231_dbb6709f932367b06b60.png'
WHERE `item_pedido`.`idItem` IN (50)
---
        $imagen->move(FCPATH . 'img', $nombreImagen);

        // Actualizar nombre de imagen en la base de datos
        $itemPedidoModel->update($idItem, [
            'urlImagen' => $nombreImagen
        ]);

SELECT *
FROM `item_pedido`
WHERE `item_pedido`.`idItem` = 51
UPDATE `item_pedido` SET `activo` = 0
WHERE `item_pedido`.`idItem` IN (51)
---
    public function desactivarProducto(int $idItem)
    {
        $itemPedidoModel = new ItemPedidoModel();

        $producto = $itemPedidoModel->find($idItem);

        if (!$producto) {
            return redirect()->to(base_url('admin/productos'))
                ->with('error', 'El producto no existe.');
        }

        $itemPedidoModel->update($idItem, [
            'activo' => 0
        ]);