app/Controllers/Promocion.php

UPDATE `promocion` SET `esPromoDia` = 0
WHERE `idItem` > 0
UPDATE `promocion` SET `esPromoDia` = 1
WHERE `idItem` = '32'
---
    public function guardarPromoDelDia()
    {
        $promocionesModel = new PromocionModel();

        $promosSeleccionadas = $this->request->getPost('promoDelDia');

        $promocionesModel
            ->where('idItem >', 0)
            ->set('esPromoDia', 0)
            ->update();

        if (!empty($promosSeleccionadas)) {

            foreach ($promosSeleccionadas as $idItem) {

                $promocionesModel
                    ->where('idItem', $idItem)
                    ->set('esPromoDia', 1)
                    ->update();