app/Models/ProductoModel.php

SELECT `item_pedido`.*
FROM `producto`
JOIN `item_pedido` ON `item_pedido`.`idItem` = `producto`.`idItem`
WHERE `item_pedido`.`activo` = 1
---
    public function obtenerProductosMenu()
    {
        return $this->select('item_pedido.*')
            ->join('item_pedido', 'item_pedido.idItem = producto.idItem')
            ->where('item_pedido.activo', 1)
            ->findAll();

SELECT `item_pedido`.*
FROM `producto`
JOIN `item_pedido` ON `item_pedido`.`idItem` = `producto`.`idItem`
---
    public function obtenerTodosLosProductos()
    {
        return $this->select('item_pedido.*')
            ->join('item_pedido', 'item_pedido.idItem = producto.idItem')
            ->findAll();