app/Models/PromocionModel.php

SELECT `item_pedido`.*
FROM `promocion`
JOIN `item_pedido` ON `item_pedido`.`idItem` = `promocion`.`idItem`
WHERE `item_pedido`.`activo` = 1
---
    public function obtenerPromociones()
    {
        return $this->select('item_pedido.*')
            ->join('item_pedido', 'item_pedido.idItem = promocion.idItem')
            ->where('item_pedido.activo', 1)
            ->findAll();