app/Models/PromocionModel.php

    public function obtenerPromociones()
    {
        return $this->select('item_pedido.*, promocion.esPromoDia, promocion.esMasVendida, promocion.incluyeBebida, promocion.incluyeEmpanadas')
            ->join(
                'item_pedido',
                'item_pedido.idItem = promocion.idItem',
            )
            ->where('item_pedido.activo', 1)
            ->orderBy('item_pedido.nombre', 'ASC')
            ->findAll();
---
SELECT `item_pedido`.*, `promocion`.`esPromoDia`, `promocion`.`esMasVendida`, `promocion`.`incluyeBebida`, `promocion`.`incluyeEmpanadas`
FROM `promocion`
JOIN `item_pedido` ON `item_pedido`.`idItem` = `promocion`.`idItem`
WHERE `item_pedido`.`activo` = 1
ORDER BY `item_pedido`.`nombre` ASC

    public function obtenerPromoDelDia()
    {
        return $this->select('item_pedido.*,promocion.esPromoDia, promocion.esMasVendida, promocion.incluyeBebida, promocion.incluyeEmpanadas')
            ->join(
                'item_pedido',
                'item_pedido.idItem = promocion.idItem'
            )
            ->where('item_pedido.activo', 1)
            ->where('promocion.esPromoDia', 1)
            ->findAll();
---
SELECT `item_pedido`.*, `promocion`.`esPromoDia`, `promocion`.`esMasVendida`, `promocion`.`incluyeBebida`, `promocion`.`incluyeEmpanadas`
FROM `promocion`
JOIN `item_pedido` ON `item_pedido`.`idItem` = `promocion`.`idItem`
WHERE `item_pedido`.`activo` = 1
AND `promocion`.`esPromoDia` = 1
SELECT `item_pedido`.*
FROM `promocion`
JOIN `item_pedido` ON `item_pedido`.`idItem` = `promocion`.`idItem`
WHERE `item_pedido`.`activo` = 1
AND `promocion`.`esPromoDia` = 1

    public function obtenerMasVendida()
    {
        return $this->select('item_pedido.*, promocion.esPromoDia, promocion.esMasVendida, promocion.incluyeBebida, promocion.incluyeEmpanadas')
            ->join(
                'item_pedido',
                'item_pedido.idItem = promocion.idItem'
            )
            ->where('item_pedido.activo', 1)
            ->where('promocion.esMasVendida', 1)
            ->first();
---
SELECT `item_pedido`.*, `promocion`.`esPromoDia`, `promocion`.`esMasVendida`, `promocion`.`incluyeBebida`, `promocion`.`incluyeEmpanadas`
FROM `promocion`
JOIN `item_pedido` ON `item_pedido`.`idItem` = `promocion`.`idItem`
WHERE `item_pedido`.`activo` = 1
AND `promocion`.`esMasVendida` = 1
 LIMIT 1

    public function obtenerTodasLasPromociones()
    {
        return $this->select('item_pedido.*, promocion.esPromoDia, promocion.esMasVendida, promocion.incluyeBebida, promocion.incluyeEmpanadas')
            ->join(
                'item_pedido',
                'item_pedido.idItem = promocion.idItem'
            )
            ->orderBy('item_pedido.nombre', 'ASC')
            ->findAll();
---
SELECT `item_pedido`.*, `promocion`.`esPromoDia`, `promocion`.`esMasVendida`, `promocion`.`incluyeBebida`, `promocion`.`incluyeEmpanadas`
FROM `promocion`
JOIN `item_pedido` ON `item_pedido`.`idItem` = `promocion`.`idItem`
ORDER BY `item_pedido`.`nombre` ASC

    public function obtenerPromocionesActivas()
    {
        return $this->select('item_pedido.*, promocion.esPromoDia, promocion.esMasVendida, promocion.incluyeBebida, promocion.incluyeEmpanadas')
            ->join(
                'item_pedido',
                'item_pedido.idItem = promocion.idItem'
            )
            ->where('item_pedido.activo', 1)
            ->orderBy('item_pedido.nombre', 'ASC')
            ->findAll();
---
SELECT `item_pedido`.*, `promocion`.`esPromoDia`, `promocion`.`esMasVendida`, `promocion`.`incluyeBebida`, `promocion`.`incluyeEmpanadas`
FROM `promocion`
JOIN `item_pedido` ON `item_pedido`.`idItem` = `promocion`.`idItem`
WHERE `item_pedido`.`activo` = 1
ORDER BY `item_pedido`.`nombre` ASC